[
  {
    "id": "bonus_2",
    "title": "The Rusted Gate",
    "unlockConditions": "Unlocked if the Bronze Key is found and 3 levels are completed with no time penalties.",
    "description": "A sealed gate near the Archive. No blueprint shows it. It radiates quiet energy.",
    "text": "It wasn’t on any map. No mechanism leads here. No blueprint mentions this gate.\n\nBut your key fits.\n\nAs it turns, the gears groan like old bones. Behind the gate — a silent room with a glowing pedestal.\n\nOn it, a message etched in brass:\n\"Efficiency unlocks more than progress. It reveals truth.\"",
    "givesAdvantage": false,
    "heroReactions": {
      "Twitch": "Speed is one thing. Precision? Now that’s a challenge.",
      "Bristle": "Used the key... and it worked. Efficiency isn’t just for nerds, I guess.",
      "Gizmo": "Locked mechanisms with no source? Intriguing. This shouldn’t exist.",
      "Whisper": "No one was meant to find this gate. But I did."
    },
    "heroEmotion": "happy"
  },
  {
    "id": "bonus_3",
    "title": "The Memory Chamber",
    "unlockConditions": "Unlocked if 3 blueprint fragments are collected but the True Exit is not activated.",
    "description": "A forgotten room behind the final control dome. A projection flickers to life.",
    "text": "\"Why didn’t I finish it?\"\nThe figure moves slowly, studying you.\n\"I built this place to train minds — not trap them. But even good ideas rust with time.\"\n\nYou show them the fragments. Their eyes light up.\n\n\"You’ve done what I could not. Escape now... but remember, no machine is perfect. Only persistent.\"",
    "givesAdvantage": false,
    "heroReactions": {
      "Twitch": "That… could’ve been me. Running without purpose. Good thing I found one.",
      "Bristle": "This old ghost… He needed help. Guess I gave it.",
      "Gizmo": "The original builder… I always wondered who designed this place.",
      "Whisper": "A memory trapped in wires. I heard his voice in the silence before."
    },
    "heroEmotion": "thoughtful"
  },
  {
    "id": "bonus_4",
    "title": "The True Exit",
    "unlockConditions": "Unlocked if 3 blueprint fragments and the Bronze Key are collected and the player chooses to use the True Exit.",
    "description": "The core glows. Gears reverse. Pistons hiss. A perfect door opens in the heart of the labyrinth — untouched by rust or time.",
    "text": "You slide the final fragment into place.\n\nThe core's glow intensifies. A low hum rises... then stops.\n\nWith a hiss of steam and a final click, the wall ahead shifts.\n\nGears reverse. Pistons lock. A hidden door opens — perfectly smooth, untouched by time.\n\nThe maze didn’t trap you.\n\nIt tested you. And now... it releases you.",
    "givesAdvantage": true,
    "heroReactions": {
      "Twitch": "Finally, a clean way out. For once, I didn’t have to run.",
      "Bristle": "Power respects power. This door knows who won.",
      "Gizmo": "Elegant. Efficient. Exactly as it was designed to be.",
      "Whisper": "There it is. The one path no one else saw — but me."
    },
    "heroEmotion": "happy"
  }
]